{
  "nav_home": "Home",
  "nav_about": "About Me",
  "nav_projects": "Projects",
  "nav_blog": "Blog",
  "nav_contact": "Contact",
  "hero_title": "Víctor Araya",
  "hero_subtitle": "DevOps Engineer",
  "hero_description": "Building reliable and scalable systems through automation, infrastructure as code, and a collaborative culture.",
  "projects_title": "Featured Projects",
  "blog_title": "Latest Posts",
  "contact_title": "Contact",
  "project_cicd_title": "CI/CD Pipeline with GitHub Actions",
  "project_cicd_desc": "Automates the deployment of this portfolio through a CI/CD pipeline using GitHub Actions.",
  "project_security_title": "Automated Security (DevSecOps)",
  "project_security_desc": "Integrates vulnerability and secret scanning into the pipeline to secure code and containers.",
  "project_iac_title": "Infrastructure as Code",
  "project_iac_desc": "Implementation of cloud infrastructure using Terraform and AWS for automated deployments.",
  "project_python_title": "Automation with Python",
  "project_python_desc": "Creation of tools and scripts in Python for cloud resource management and task automation.",
  "project_k8s_title": "Kubernetes Cluster",
  "project_k8s_desc": "Configuration and management of a Kubernetes cluster for containerized applications.",
  "project_monitoring_title": "Systems Monitoring",
  "project_monitoring_desc": "Prometheus, Grafana, and Alertmanager stack for distributed infrastructure.",
  "about_page_title": "About Me - Víctor Araya",
  "about_main_title": "My Work Philosophy",
  "about_p1": "I'm Víctor Araya, a family man and a self-taught systems engineer focused on the Cloud ecosystem. My journey in technology has taught me a fundamental lesson: the most robust systems are not those that never fail, but those designed to be resilient, observable, and able to recover quickly.",
  "about_subtitle1": "From the \"How\" to the \"Why\"",
  "about_p2": "My passion for DevOps was born from a curiosity to go beyond simply executing tasks. Instead of asking, \"how do I deploy this application?\", I began to wonder, \"how do we build a system that allows for safe, automated deployments at any time with minimal human intervention?\".",
  "about_p3": "This question led me to delve into the principles of Infrastructure as Code (IaC), continuous delivery (CI/CD), and observability. I see technology not as an end in itself, but as a means to achieve crucial business objectives: agility, stability, and trust.",
  "about_subtitle2": "Culture of Continuous Improvement",
  "about_p4": "I adopt an iterative improvement mindset in everything I do. I firmly believe that automation is the key to unlocking human potential, allowing teams to focus on innovation rather than crisis management. To me, a well-designed CI/CD pipeline or an idempotent Terraform script are more than just tools; they are the embodiment of a culture that values consistency, predictability, and collaboration.",
  "about_back_button": "← Back to home",
  "blog_fundamentos_title": "Foundations",
  "blog_fundamentos_excerpt": "Exploring the essential concepts of Kubernetes and how to apply them in Site Reliability Engineering environments…",
  "blog_automatizacion_title": "Automation",
  "blog_automatizacion_excerpt": "How to implement infrastructure as code using Terraform to manage resources across multiple clouds…",
  "blog_monitoreo_title": "Monitoring",
  "blog_monitoreo_excerpt": "Advanced Prometheus configuration for monitoring distributed systems and effective alerting strategies…",
  "blog_read_more": "Read more"
}
