{
  "nav_home": "Inicio",
  "nav_about": "Sobre mí",
  "nav_projects": "Proyectos",
  "nav_blog": "Blog",
  "nav_contact": "Contacto",
  "hero_title": "Víctor Araya",
  "hero_subtitle": "Ingeniero DevOps",
  "hero_description": "Construyendo sistemas fiables y escalables a través de la automatización, la infraestructura como código y la cultura colaborativa.",
  "projects_title": "Proyectos Destacados",
  "blog_title": "Últimas Publicaciones",
  "contact_title": "Contacto",
  "project_cicd_title": "Pipeline CI/CD con GitHub Actions",
  "project_cicd_desc": "Automatiza el despliegue de este portafolio mediante un pipeline de CI/CD con GitHub Actions.",
  "project_security_title": "Seguridad Automatizada (DevSecOps)",
  "project_security_desc": "Integra escaneo de vulnerabilidades y secretos en el pipeline para asegurar el código y los contenedores.",
  "project_iac_title": "Infraestructura como Código",
  "project_iac_desc": "Implementación de infraestructura en la nube usando Terraform y AWS para despliegues automatizados.",
  "project_python_title": "Automatización con Python",
  "project_python_desc": "Creación de herramientas y scripts en Python para la gestión de recursos en la nube y la automatización de tareas.",
  "project_k8s_title": "Clúster de Kubernetes",
  "project_k8s_desc": "Configuración y gestión de un clúster de Kubernetes para aplicaciones en contenedores.",
  "project_monitoring_title": "Monitoreo de Sistemas",
  "project_monitoring_desc": "Stack Prometheus, Grafana y Alertmanager para infraestructura distribuida.",
  "about_page_title": "Sobre Mí - Víctor Araya",
  "about_main_title": "Mi Filosofía de Trabajo",
  "about_p1": "Soy Víctor Araya, padre de familia, un ingeniero de sistemas autodidacta enfocado en el ecosistema Cloud. Mi trayectoria en tecnología me ha enseñado una lección fundamental: los sistemas más robustos no son los que nunca fallan, sino los que están diseñados para ser resilientes, observables y capaces de recuperarse con rapidez.",
  "about_subtitle1": "Del \"Cómo\" al \"Porqué\"",
  "about_p2": "Mi pasión por DevOps nació de la curiosidad por ir más allá de la simple ejecución de tareas. En lugar de preguntar \"¿cómo despliego esta aplicación?\", comencé a preguntarme \"¿cómo construimos un sistema que permita despliegues seguros y automatizados, a cualquier hora y con mínima intervención humana?\".",
  "about_p3": "Esta pregunta me llevó a profundizar en los principios de la Infraestructura como Código (IaC), la entrega continua (CI/CD) y la observabilidad. Entiendo la tecnología no como un fin en sí misma, sino como un medio para alcanzar objetivos de negocio cruciales: agilidad, estabilidad y confianza.",
  "about_subtitle2": "Cultura de Mejora Continua",
  "about_p4": "Adopto una mentalidad de mejora iterativa en todo lo que hago. Creo firmemente que la automatización es la clave para liberar el potencial humano, permitiendo que los equipos se centren en la innovación en lugar de en la gestión de crisis. Para mí, un pipeline de CI/CD bien diseñado o un script de Terraform idempotente son más que simples herramientas; son la materialización de una cultura que valora la consistencia, la previsibilidad y la colaboración.",
  "about_back_button": "← Ir al inicio"
  "blog_fundamentos_title": "Fundamentos",
  "blog_fundamentos_excerpt": "Explorando los conceptos esenciales de Kubernetes y cómo aplicarlos en entornos de Site Reliability Engineering…",
  "blog_automatizacion_title": "Automatización",
  "blog_automatizacion_excerpt": "Cómo implementar infraestructura como código usando Terraform para gestionar recursos en múltiples nubes…",
  "blog_monitoreo_title": "Monitoreo",
  "blog_monitoreo_excerpt": "Configuración avanzada de Prometheus para monitoreo de sistemas distribuidos y estrategias de alerting efectivas…",
  "blog_read_more": "Leer más"
}
